{
  "personalInfo": {
    "firstName": "Sorin-Ionut",
    "lastName": "Zamfir",
    "email": "dexterionut@gmail.com",
    "phone": "+40761546038",
    "address": "Bucuresti, Sector 4"
  },
  "bio": "Student la licență , Calculatoare si Tehnologia Informatiei, Facultatea de Matematică și Informatică, Universitatea București. Sunt o persoana ambitioasa, nu refuz niciodata o provocare si nu ma dau batut foarte usor, pasiunile mele cele mai mari fiind programarea si tehnologiile web.",
  "education": [
    {
      "startDate": "2015",
      "endDate": "2019",
      "title": "Facultatea de Matematica si Informatica, Universitatea Bucuresti",
      "contentLines": [
        "Calculatoare si Tehnologia Informatiei"
      ]
    },
    {
      "startDate": "2011",
      "endDate": "2015",
      "title": "Liceul Teoretic Zimnicea",
      "contentLines": [
        "Matematica Informatica"
      ]
    }
  ],
  "workExperience": [
    {
      "startDate": "09.2020",
      "endDate": "Present",
      "title": "Gorgias - Fullstack Software Engineer with Python and React",
      "contentLines": [
        "Led a team of 3 people in order to bootstrap a new project of integrating with the BigCommerce API. The 3 people were all new comers and my responsibility was to monitor their progress and help them grow into their roles, impose company wide (but not limited to) coding standards and best practices via code reviews and sync meetings, share the knowledge on the internal code architecture and workflow for adding a new integration.",
        "Implemented various custom HTTP clients in Python for integrating with different APIs. An HTTP Client was specifically crafted for each individual platform in order to support authentication, requesting and rate limiting of that API and to accommodate for specific data and error structures.",
        "Helped monitoring our system for degradation or critical errors by using Datadog and Sentry and also by implementing new monitors and taking part in on-call shifts.",
        "Helped our customers with their technical (but not limited to) questions or problems by taking part in level-3 customer support shifts (technical).",
        "Implemented new endpoints in our API in order to provide new features to our partners. Wrote documentation based on the OpenAPI Specification for existing and new endpoints of our API.",
        "Implemented the Two-Factor Authentication using an authenticator app. My responsibility was to conduct a feasibility analysis on what Python and Typescript libraries we should choose, to write the technical specs and implement the feature.",
        "Added new integration with Twitter and Twitter DMs APIs. My responsibility was to run feasibility analysis on the APIs in order to determine if the features we wanted to achieve were possible and then to implement the features. During the feasibility analysis I discovered that some of the Twitter APIs were under a paywall and helped writing the new scope of the integration with Twitter with this new information in mind. Based on that and I've created the technical specs for the integration and split it into tasks as small as possible in order to easy estimate them.",
        "Helped rotating secrets/keys for integrations with various APIs after a security breach in Codeconv. The challenge here was that we wanted to achieve this with 0 downtime and I had to adjust the code to work with both old and new secrets/keys for some integrations.",
        "Fine tuned an inefficient PostgreSQL query which led to significant improvement in latency for a filter.",
        "Added a new integration for Instagram mentions. My responsibility was to run a feasibility analysis on the Instagram API in order to determine if the features we wanted to achieve were possible and then to implement the feature. Based on the feasibility analysis I've created the technical specs for the integration and split it into tasks as small as possible in order to easy estimate them.",
        "Improved the QoL of customers by implementing bugfixes and new features on top of the existing integrations with the Facebook, Twitter, Shopify, Magento2, Outlook, Gmail APIs."
      ],
      "leveraged": "Python, PostgreSQL, Flask, Rest APIs, Celery, Celery workers, Typescript, React, React functional components, Docker, RabbitMQ, Kubernetes, Google cloud (Kubernetes, PubSub), Terraform, Datadog, Sentry, Gitlab CI/CD"
    },
    {
      "startDate": "06.2019",
      "endDate": "08.2020",
      "title": "Zitec - Software Engineer",
      "contentLines": [
        "Helped to design and develop a custom RESTful payment gateway between client's application and PayU System",
        "Maintaining and developing current and new features for a high availability web app in the fintech industry",
        "Integrated a ETL pipeline using Azure Data Factory and developed custom reports using PowerBI",
        "Helped migrating a project's local development environment from Vagrant to Docker"
      ],
      "leveraged": "PHP, MySQL, Symfony 3, Symfony 4, Sonata CRM, Vagrant, Jenkins, Ansible, CronJobs, Azure Cloud Technologies (Virtual Machines, MySQL, Blob Storage, Queues, Data Factory), Docker"
    },
    {
      "startDate": "07.2018",
      "endDate": "05.2019",
      "title": "Gameloft Romania - Backend web developer",
      "contentLines": [
        "Maintaining and creating new custom big data ETL pipelines",
        "Data extraction using SQL and SQL like queries",
        "Data manipulation in Python using Pandas",
        "Talking to the Reporting team, understanding their needs and crafting custom reports based on them",
        "Developed a web app, for the reporting team, with a user friendly interface to query a proprietary big data system, to reduce the number of tasks for simple reports"
      ],
      "leveraged": "Java, Python, PHP, Angular, Pandas, ETL Custom Big Data Pipelines, Microsoft Excel Pivoting, CronJobs"
    },
    {
      "startDate": "06.2016",
      "endDate": "07.2018",
      "title": "Be IT Systems - Full stack web developer",
      "contentLines": [
        "Designing and developing new custom web applications",
        "Maintaining and developing new features for current applications"
      ],
      "leveraged": "Full Stack Web Development, PHP, MySQL, Laravel, HTML/CSS/JavaScript, AngularJS, Git, installing and deploying LAMP stacks on unix systems, ubuntu server mostly"
    }
  ],
  "skills": {
    "proficient": "Python, PostgreSQL, Flask, SQLAlchemy, Rest APIs, Celery, Celery workers, Typescript, React, React functional components, Docker, RabbitMQ, Kubernetes, Google cloud (Kubernetes, PubSub), PHP, HTML/CSS/Javascript, SQL, Laravel, Symfony 3/4, Angular 2+, Pandas, Git, Unix",
    "familiar": "Java, C#, Docker, .NET, Spring Boot, Ionic 4, Cordova, Azure Cloud, AWS, Terraform, Datadog, Sentry"
  },
  "projects": [
    {
      "title": "Home automation: Google Home actions to remotely control computer",
      "contentLines": [
        "Developed some google home actions to help control my computer using voice. Features: turn on/off computer, open games"
      ],
      "utilized": "Python, Flask, Flask-Assistant, Google Drive, Git"
    },
    {
      "title": "Home automation: wake on lan computer and wireless switches",
      "contentLines": [
        "Developed multiple firmware for ESP8266 microcontroller that expose endpoints to wake on lan computer and turn on/off some devices using relays"
      ],
      "utilized": "C programming, ESP8266 microcontroller, electric relay, Arduino IDE, Git"
    },
    {
      "title": "Check-in/out system for attendance at teaching activities",
      "contentLines": [
        "Designed and developed a system that allows students to check-in/out their presence at teaching activities",
        "Developed a mobile cross-platform app for students and teachers where teachers can start a presence session and the students can check-in/out",
        "Developed a web app where top management can manage the courses, students and professors allocation, attendances and can see some statistics for future decisions about the programs",
        "Developed a RESTful api consumed by the front end applications",
        "Developed the system using the microservices architecture, the system being split in multiple microservices based on domain logic(student microservice, professor microservice, management microservice, statistics microservice)",
        "Containerized each microservice"
      ],
      "utilized": "PHP, MySQL, Python, Symfony 4, Flask, Pandas, Ionic 4, Cordova, Angular 7, Git"
    },
    {
      "title": "Budget planner",
      "contentLines": [
        "Designed and developed a application that help users to track and manage their income and expenses",
        "Developed an iOS app which represent the front end of the application where user can add their income, expenses, can set targets and see some statistics",
        "At a later stage i decided to make the mobile app cross-platform, so i switched to develop it from ground up using Ionic Framework",
        "Developed RESTful json api backend consumed by the iOS app, that integrates all the functionality described",
        "Integrated Docker for building and developing the applications"
      ],
      "utilized": "C#, .NET Core, Entity Framework, MySQL, Swift 4, Ionic 3, Cordova, Docker, Git"
    },
    {
      "title": "Research platform for university(like google research)",
      "contentLines": [
        "Designed and developed a web platform with minimal features to store and view metadata about books, research papers, scientific conferences"
      ],
      "utilized": "PHP, MySQL, Laravel, HTML/CSS/Javascript, AngularJS 1.3, Bootstrap, Git"
    },
    {
      "title": "Servers inventory management system",
      "contentLines": [
        "Designed and developed a web application used to manage a virtual machines rental business",
        "Developed the web interface for business owner where he could manage users, virtual machines, IP addresses and other services",
        "Developed the web interface for clients where they could see what servers and services they have active and their monthly price to pay"
      ],
      "utilized": "PHP, MySQL, Laravel, HTML/CSS/Javascript, AngularJS 1.3, Bootstrap, Git"
    },
    {
      "title": "Image mosaic generator",
      "contentLines": [
        "Developed a small application that allowed users to convert any image into a mosaic image(when zoomed out you see the user's image, and when you zoom in you see small, individual images)"
      ],
      "utilized": "Python, OpenCV, NumPy, Flask, Git"
    },
    {
      "title": "Online store admin panel",
      "contentLines": [
        "Designed and developed a web application used to manage categories, products and prices of an online store"
      ],
      "utilized": "Java, MySQL, Spring Boot, Hibernate, HTML/CSS/Javascript, Angular 2, Bootstrap, Git"
    },
    {
      "title": "Reporting system for the internal system of the insurance company",
      "contentLines": [
        "Helped to design and develop a reporting system that allows top management from the insurance company to query the database for reports",
        "Developed a user-friendly web interface that transformed user input into SQL queries to generate data lists and graphs"
      ],
      "utilized": "PHP, MySQL, Laravel, HTML/CSS/Javascript, AngularJS 1.3, Bootstrap, Git"
    },
    {
      "title": "Internal system for insurance company",
      "contentLines": [
        "Helped to design and develop a complex web application that allowed automating and also digitization of their internal workflow",
        "Developed a Task interface for the employees to watch and get informed about what they have to do",
        "Developed a system that fetches emails from the company's official insurance complains email, parse them and create tasks",
        "Developed a system that allows employees to create and manage insurance claims, including specific entities to the claim and manual file uploads",
        "Developed a Workflow Approval System where some application entities would be sent for feedback and approval to multiple persons/departments"
      ],
      "utilized": "PHP, MySQL, Laravel, HTML/CSS/Javascript, AngularJS 1.3, Bootstrap, SOCKET.IO, Redis, NodeJS, CronJobs, Git"
    },
    {
      "title": "Custom content management system for internal use",
      "contentLines": [
        "Developed a web CMS with the following features: instant messaging, file sharing, news dashboard",
        "Developed a multi-tab directive for AngularJS that can be reused"
      ],
      "utilized": "PHP, MySQL, Laravel, HTML/CSS/Javascript, AngularJS 1.3, Bootstrap, SOCKET.IO, Redis, NodeJS, Git"
    },
    {
      "title": "Similar platform to UberEats",
      "contentLines": [
        "Developed a web interface for the food shops that allows users to manage their products, prices and available hours",
        "Maintained and developed new features for the existing application"
      ],
      "utilized": "PHP, MySQL, Laravel, HTML/CSS/Javascript, AngularJS 1.3, Bootstrap, Git"
    }
  ]
}
